/*
Сделайте класс Group из предыдущего упражнения итерируемым. Если вы
не помните точный вид интерфейса итератора, перечитайте раздел, посвященный этому интерфейсу,
ранее в данной главе.
Если для представления членов группы вы использовали массив, не возвращайте просто итератор,
созданный путем вызова метода Symbol.iterator для массива. Это бы сработало, но оно не соответствует
цели данного упражнения.
Если ваш итератор ведет себя странно, когда группа изменяется во время
итерации, — это нормально
*/